In [1]:
# importing the packages
import pandas as pd


data = {
    'Order ID': [1, 2, 3, 4],
    'Discount': ['10%','20%','30%','13%'],
    'Offer Price': [200, 350,340,350]
}

df = pd.DataFrame(data)

df

   Order ID Discount  Offer Price
0         1      10%          200
1         2      20%          350
2         3      30%          340
3         4      13%          350

In [2]:
range = max(df['Offer Price']) - min(df['Offer Price'])

In [3]:
range

150

In [4]:
df['NewDiscount'] = df['Discount'].map(lambda x: int(x.rstrip('%')))

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Order ID     4 non-null      int64
 1   Discount     4 non-null      object
 2   Offer Price  4 non-null      int64
 3   NewDiscount  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [6]:
df

   Order ID Discount  Offer Price  NewDiscount
0         1      10%          200           10
1         2      20%          350           20
2         3      30%          340           30
3         4      13%          350           13

In [7]:
data2 = {
    'Order ID': [1, 2, 3, 4],
    'Offer': ['OC1;OC2;OC3', 'OC4', 'OC5;OC1', 'OC2;OC4'],
    'Offer Price': ['200;300;400', '350', '340;200', '300;350']
}

In [14]:
df2 = pd.DataFrame(data2)
df2

# pivot df2 such that each offer and offer price is in a single line

   Order ID        Offer  Offer Price
0         1  OC1;OC2;OC3  200;300;400
1         2          OC4          350
2         3      OC5;OC1      340;200
3         4      OC2;OC4      300;350

In [25]:
import pandas as pd

data2 = {
    'Order ID': [1, 2, 3, 4],
    'Offer': ['OC1;OC2;OC3', 'OC4', 'OC5;OC1', 'OC2;OC4'],
    'Offer Price': ['200;300;400', '350', '340;200', '300;350']
}

df2 = pd.DataFrame(data2)

# Splitting the 'Offer' and 'Offer Price' columns and creating new rows
new_rows = []
for index, row in df2.iterrows():
    offers = row['Offer'].split(';')
    prices = row['Offer Price'].split(';')
    for offer, price in zip(offers, prices):
        new_rows.append([row['Order ID'], offer, int(price)])

# Creating a new DataFrame from the list of new rows
new_df = pd.DataFrame(new_rows, columns=['Order ID', 'Offer', 'Offer Price'])

print(new_df)

   Order ID Offer  Offer Price
0         1   OC1          200
1         1   OC2          300
2         1   OC3          400
3         2   OC4          350
4         3   OC5          340
5         3   OC1          200
6         4   OC2          300
7         4   OC4          350

In [16]:
df2

   Order ID Offer      Offer Price
0         1   OC1  [200, 300, 400]
1         1   OC2  [200, 300, 400]
2         1   OC3  [200, 300, 400]
3         2   OC4            [350]
4         3   OC5       [340, 200]
5         3   OC1       [340, 200]
6         4   OC2       [300, 350]
7         4   OC4       [300, 350]